{
  "Title": "Carrot Cake",
  "Sprite": "CarrotCake",
  "Link": "http://www.joannasoh.com/foods/recipes-1/skinny-healthy-carrot-cake-recipe-no-butter-or-sugar",
  "PreparationTime": 25,
  "CookTime": 30,
  "Serves": 6,
  "Calories": 176.6,
  "Tags": [ 0,3,4  ],
  "Difficulty": 3,
  "Ingredients": [
    "1 cup Whole Wheat flour - 432Cals",
	"2.5 tsp Baking Powder - 5Cals",
	"1 tsp Cinnamon / Mixed Spices - 6Cals",
	"2 Eggs - 160Cals",
	"1/2 cup Honey or Maple Syrup - 515.5Cals",
	"1/4 cup Extra Virgin Olive Oil - 477.5Cals",
	"1/2 cup Applesauce, unsweetened - 51.5Cals",
	"1 tsp Vanilla Extract - 12Cals",
	"1.5 cups Carrots, peeled & grated - 67.5Cals",
	"1/2 cup ground Cashew Nuts or other nuts, - 393Cals",
	"",
	"Option, Ingredients for Cream Cheese Frosting",
	"3oz (85g) Cream Cheese - 228Cals",
	"1/4 cup plain Yogurt - 42Cals",
	"1/2 tsp Vanilla Extract - 6Cals",
	"2 tbsp Stevia for extra sweetness (optional)"

  ],
  "Instructions": [
    "Preheat the oven to 180 degrees Celsius / 350 degrees Fahrenheit.",
	"In a bowl, combine the dry ingredients; flour, baking powder and mixed spices. Set aside.",
	"In a large bowl, beat the eggs on high speed for about one minute until foamy.",
	"Add in the honey and beat on high speed for another 3 - 4 minutes until well combined.",
	"Then stir in the olive oil, applesauce and vanilla extract until thoroughly combined.",
	"Next, add in ? of the flour mixture and stir until just combine. Add in the remaining flour mixture. Stir well.",
	"Finally, fold in the grated carrots and cashew nuts.",
	"Grease either a heart-shaped or 8-inch cake tin with a little bit of olive oil.",
	"Pour the batter into the cake tin and spread out evenly.",
	"Place in the oven and bake for 30 - 35 minutes until a toothpick inserted into the center comes out clean.",
	"While waiting for the cake to bake in the oven, let's go ahead and make our light and healthy cream cheese frosting",	
	"",
	"Cream Cheese Frosting:",
	"In a pan or bowl, beat the cream cheese until soft for about 1 minute.",
	"Add in the yogurt and vanilla extract. Continue to beat for 2 - 3 minutes until smooth and well combined.",
	"Finally stir in the Stevia. You can choose to omit this if you do not have Stevia.",
	"Chill the cream cheese frosting in the fridge until ready to use.",
	"Once the cake is done, remove from the oven and allow it to cool completely to room temperature before assembling and frosting your cake."
  ]
}